Revit 2026 API

# ImageInstanceHeight Property

---

The height of the ImageInstance.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Height { get; set; }
```
```vb
Public Property Height As Double
	Get
	Set
```
```cpp
public:
property double Height {
	double get ();
	void set (double value);
}
```
```fsharp
member Height : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for height results in a width that is more than 30000 feet because LockProportions is set to true. |
| ArgumentOutOfRangeException | When setting this property: The given value for height must be between 0 and 30000 feet. |

If LockProportions is true, then changes to the Height will also result in changes to the Width.

#### Reference

ImageInstance Class

Autodesk.Revit.DB Namespace